---
kind: property
id: P:Autodesk.Revit.DB.Mechanical.Space.SpaceType
source: html/0d0a857a-40a8-df93-42f9-b14c4c1a3c2a.htm
---
# Autodesk.Revit.DB.Mechanical.Space.SpaceType Property

Get or set the Space type of the Space.

## Syntax (C#)
```csharp
public SpaceType SpaceType { get; set; }
```

## Remarks
This property is used to get or set the Space type of the Space.